// 1) Наследование подтипов (subtype inheritance):
//  - Родительский класс Животное, наследники Кошка, Собака, ...

// 2) Наследование с ограничением (restriction inheritance):
//  - Родительский класс Дом, наследники ДеревянныйДом, КирпичныйДом. Ограничение по типу материала.
//  - Родительский класс Четырехугольник, наследники Прямоугольник (ограничение - прямой угол), наследник Прямоугольника - Квадрат (ограничение стороны равны)

// 3) Наследование с расширением (extension inheritance)
//  Родительский класс Ребенок, наследник Ученик (новая операция ходит в школу, получает оценки)
